EDT/УТ/src/Catalogs/зпНачисления/зпНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зпНачисления</name>
  <predefined>
    <items>
      <name>ВыполнениеЗабора</name>
      <description>Выполнение забора</description>
    </items>
    <items>
      <name>ВыполнениеФрахта</name>
      <description>Выполнение фрахта</description>
    </items>
    <items>
      <name>ДоплатаДоМинимальногоРазмераОплаты</name>
      <description>Доплата до минимального размера оплаты</description>
    </items>
    <items>
      <name>ДоплатаЗаПарковку</name>
      <description>Доплата за парковку</description>
    </items>
    <items>
      <name>ДоплатаЗаПробег</name>
      <description>Доплата за пробег</description>
    </items>
    <items>
      <name>ДоплатаЗаПробегЗаМКАД</name>
      <description>Доплата за пробег (за МКАД)</description>
    </items>
    <items>
      <name>ДоплатаЗаЧасыПереработки</name>
      <description>Доплата за часы переработки</description>
    </items>
    <items>
      <name>ДоплатаЗаЭкспедирование</name>
      <description>Доплата за экспедирование</description>
    </items>
    <items>
      <name>ДоставкаЗаказа</name>
      <description>Доставка заказа</description>
    </items>
    <items>
      <name>ДоставкаЗаказаVIP</name>
      <description>Доставка заказа (VIP)</description>
    </items>
    <items>
      <name>МагистральныйРейс</name>
      <description>Магистральный рейс</description>
    </items>
    <items>
      <name>НочнойВодитель</name>
      <description>Ночной водитель</description>
    </items>
    <items>
      <name>ОплатаПоСменам</name>
      <description>Оплата по сменам</description>
    </items>
    <items>
      <name>ОплатаПодъемаНаЭтажПриДоставкеЗаказа</name>
      <description>Оплата подъема на этаж (доставка заказа)</description>
    </items>
    <items>
      <name>Примерка</name>
      <description>Примерка</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.зпСпособыРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетЧасовПереработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбслуживанияДоставки</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>EnumRef.зпВидыНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеНачислениеИспользуетсяВФиксацииНачислений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоУмолчаниюВФиксацииНачислений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислениеНеАктуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Enums/зпВидыНачислений/зпВидыНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>зпВидыНачислений</name>
  <enumValues>
    <name>ОсновноеНачисление</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеНачисление</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/зпНачисления/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ВидНачисления.ТолькоПросмотр = Ложь;
	КонецеСли;	
	
	Элементы.СуммаПоУмолчаниюВФиксацииНачислений.Видимость = Объект.ДополнительноеНачислениеИспользуетсяВФиксацииНачислений;
	
	//Асеев 01.08.2024 (Задача № 5299)>>>
	Элементы.ДекорацияНачислениеНеАктуально.Видимость = Объект.НачислениеНеАктуально;
	//Асеев 01.08.2024 (Задача № 5299)<<<

КонецПроцедуры

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)
	Если Объект.ВидНачисления = Перечисления.зпВидыНачислений.ДополнительноеНачисление Тогда
		Элементы.ДополнительноеНачислениеИспользуетсяВФиксацииНачислений.Доступность = Истина;
	Иначе
		Элементы.ДополнительноеНачислениеИспользуетсяВФиксацииНачислений.Доступность = Ложь;
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ВидНачисленияПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ДополнительноеНачислениеИспользуетсяВФиксацииНачисленийПриИзмененииНаСервере()
	
	Элементы.СуммаПоУмолчаниюВФиксацииНачислений.Видимость = Объект.ДополнительноеНачислениеИспользуетсяВФиксацииНачислений;
	Если Не Объект.ДополнительноеНачислениеИспользуетсяВФиксацииНачислений Тогда
		Объект.СуммаПоУмолчаниюВФиксацииНачислений = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноеНачислениеИспользуетсяВФиксацииНачисленийПриИзменении(Элемент)
	ДополнительноеНачислениеИспользуетсяВФиксацииНачисленийПриИзмененииНаСервере();
КонецПроцедуры
